* hunspell executable
  #+BEGIN_SRC emacs-lisp
(executable-find "hunspell")
  #+END_SRC

  #+RESULTS:
  : c:/msys64/mingw64/bin/hunspell.exe

  Ok, we're set

  #+BEGIN_SRC emacs-lisp
(ispell-change-dictionary "en_US" t)
(setq ispell-program-name (executable-find "hunspell"))

(setenv
 "DICPATH"
 "C:/msys64/mingw64/share/hunspell"
 )

(setq ispell-local-dictionary-alist
      '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil nil nil utf-8)))

(setq ispell-local-dictionary-alist
      '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" t
         ("-d" "en_US") nil iso-8859-1)))

  #+END_SRC

